// Задача 6. Из центра координат к точке А(x, y) проведён отрезок АО. 
// Напишите программу, определяющую наименьший угол наклона отрезка AO к оси X.

int x = 2;
int y = 2;
Console.WriteLine("*********************************************************");
Console.WriteLine($"Из центра координат проведена прямая к точке A [{x}:{y}]");
Console.WriteLine($"Найдем наименьший угол наклона к оси X...");

double angle = Math.Atan2(Math.Abs(y), Math.Abs(x)) * 180 / Math.PI;
if (angle > 90) angle = 180 - angle;
Console.WriteLine($"Угол равен {Math.Round(angle, 2)} градуса (-ов)");
Console.WriteLine("*********************************************************");